dwijaybane/msp430/Source Files/eusci_uart.c
    return ( retVal) ;
}
//*****************************************************************************
//
//! Transmits a byte from the UART Module.
//!
//! \param baseAddress is the base address of the UART module.
//! \param transmitData data to be transmitted from the UART module
//!
//! This function will place the supplied data into UART trasmit data register
//! to start transmission
//!
//! Modified register is \b UCAxTXBUF
//! \return None.
//
//*****************************************************************************
void EUSCI_UART_transmitData ( unsigned int baseAddress,
    unsigned char transmitData
    )
{
    HWREG(baseAddress + OFS_UCAxTXBUF) = transmitData;
}

//*****************************************************************************
//
//! Receives a byte that has been sent to the UART Module.
//!
//! \param baseAddress is the base address of the UART module.
//!
//! This function reads a byte of data from the UART receive data Register.
//!
//! Modified register is \b UCAxRXBUF
//!
//! \return Returns the byte received from by the UART module, cast as an
//! unsigned char.
//
//*****************************************************************************
unsigned char EUSCI_UART_receiveData (unsigned int baseAddress)
{
    return ( HWREG(baseAddress + OFS_UCAxRXBUF)) ;
}

//*****************************************************************************
//
//! Enables individual UART interrupt sources.
//!
//! \param baseAddress is the base address of the UART module.
//! \param mask is the bit mask of the interrupt sources to be enabled.
//!
//! Enables the indicated UART interrupt sources.  The interrupt flag is first
//! and then the corresponfing interrupt is enabled. Only the sources that
//! are enabled can be reflected to the processor interrupt; disabled sources
//! have no effect on the processor.
//!
//! The mask parameter is the logical OR of any of the following:
//! - \b EUSCI_UART_RECEIVE_INTERRUPT -Receive interrupt
//! - \b EUSCI_UART_TRANSMIT_INTERRUPT - Transmit interrupt
//! - \b EUSCI_UART_RECEIVE_ERRONEOUSCHAR_INTERRUPT - Receive erroneous-character
//!                             interrupt enable
//! - \b EUSCI_UART_BREAKCHAR_INTERRUPT - Receive break character interrupt enable
//!
//! Modified register is \b UCAxIFG, \b UCAxIE and \b UCAxCTL1
//!
//! \return None.
//
//*****************************************************************************
void EUSCI_UART_enableInterrupt (unsigned int baseAddress,
    unsigned char mask
    )
{
    ASSERT((EUSCI_UART_RECEIVE_INTERRUPT == mask) ||
        (EUSCI_UART_TRANSMIT_INTERRUPT == mask) ||
        (EUSCI_UART_RECEIVE_ERRONEOUSCHAR_INTERRUPT == mask) ||
        (EUSCI_UART_BREAKCHAR_INTERRUPT == mask)
        );
    switch (mask){
        case EUSCI_UART_RECEIVE_INTERRUPT:
        case EUSCI_UART_TRANSMIT_INTERRUPT:
            //Clear interrupt flag
            HWREG(baseAddress + OFS_UCAxIFG) &= ~(mask);
            //Enable Interrupt
            HWREG(baseAddress + OFS_UCAxIE) |= mask;
            break;
        case EUSCI_UART_RECEIVE_ERRONEOUSCHAR_INTERRUPT:
        case EUSCI_UART_BREAKCHAR_INTERRUPT:
            //Enable Interrupt
            HWREG(baseAddress + OFS_UCAxCTLW0) |= mask;
            break;
    }
}

//*****************************************************************************
//
//! Disables individual UART interrupt sources.
//!
//! \param baseAddress is the base address of the UART module.
//! \param mask is the bit mask of the interrupt sources to be
//! disabled.
//!
//! Disables the indicated UART interrupt sources.  Only the sources that
//! are enabled can be reflected to the processor interrupt; disabled sources
//! have no effect on the processor.
//!
//! The mask parameter is the logical OR of any of the following:
//! - \b EUSCI_UART_RECEIVE_INTERRUPT -Receive interrupt
//! - \b EUSCI_UART_TRANSMIT_INTERRUPT - Transmit interrupt
//! - \b EUSCI_UART_RECEIVE_ERRONEOUSCHAR_INTERRUPT - Receive erroneous-character
//!                             interrupt enable
//! - \b EUSCI_UART_BREAKCHAR_INTERRUPT - Receive break character interrupt enable
//!
//! Modified register is \b UCAxIFG, \b UCAxIE and \b UCAxCTL1
//! \return None.
//
//*****************************************************************************
void EUSCI_UART_disableInterrupt (unsigned int baseAddress,
    unsigned char mask
    )
{
    ASSERT((EUSCI_UART_RECEIVE_INTERRUPT == mask) ||
        (EUSCI_UART_TRANSMIT_INTERRUPT == mask) ||
        (EUSCI_UART_RECEIVE_ERRONEOUSCHAR_INTERRUPT == mask) ||
        (EUSCI_UART_BREAKCHAR_INTERRUPT == mask)
        );

    switch (mask){
        case EUSCI_UART_RECEIVE_INTERRUPT:
        case EUSCI_UART_TRANSMIT_INTERRUPT:
            //Disable Interrupt
            HWREG(baseAddress + OFS_UCAxIE) &= ~mask;
            break;
        case EUSCI_UART_RECEIVE_ERRONEOUSCHAR_INTERRUPT:
        case EUSCI_UART_BREAKCHAR_INTERRUPT:
            //Disable Interrupt
            HWREG(baseAddress + OFS_UCAxCTLW0) &= ~mask;
            break;
    }
}

//*****************************************************************************
//
//! Gets the current UART interrupt status.
//!
//! \param baseAddress is the base address of the UART module.
//! \param mask is the masked interrupt flag status to be returned.
//!
//! This returns the interrupt status for the UART  module based on which
//! flag is passed. mask parameter can be either any of the following
//! selection.
//! - \b EUSCI_UART_RECEIVE_INTERRUPT_FLAG -Receive interrupt flag
//! - \b EUSCI_UART_TRANSMIT_INTERRUPT_FLAG - Transmit interrupt flag
//!
//! Modified register is \b UCAxIFG.
//!
//! \return The current interrupt status, returned as with the respective bits
//! set if the corresponding interrupt flag is set
//
//*****************************************************************************
unsigned char EUSCI_UART_getInterruptStatus (unsigned int baseAddress,
    unsigned char mask)
{
    ASSERT(  (EUSCI_UART_RECEIVE_INTERRUPT_FLAG == mask) ||
        (EUSCI_UART_TRANSMIT_INTERRUPT_FLAG == mask)
        );

    return ( HWREG(baseAddress + OFS_UCAxIFG) & mask );
}

//*****************************************************************************
//
//! Clears UART interrupt sources.
//!
//! \param baseAddress is the base address of the UART module.
//! \param mask is a bit mask of the interrupt sources to be cleared.
//!
//! The UART interrupt source is cleared, so that it no longer asserts.
//! The highest interrupt flag is automatically cleared when an interrupt vector
//! generator is used.
//!
//! The mask parameter has the same definition as the mask parameter to
//! EUSCI_UART_enableInterrupt().
//!
//! Modified register is \b UCAxIFG
//!
//! \return None.
//
//*****************************************************************************
void EUSCI_UART_clearInterruptFlag (unsigned int baseAddress, unsigned char mask)
{
    //Clear the UART interrupt source.
    HWREG(baseAddress + OFS_UCAxIFG) &= ~(mask);
}

//*****************************************************************************
//
//! Enables the UART block.
//!
//! \param baseAddress is the base address of the USCI UART module.
//!
//! This will enable operation of the UART block.
//!
//! Modified register is \b UCAxCTL1
//!
//! \return None.
//
//*****************************************************************************
void EUSCI_UART_enable (unsigned int baseAddress)
{
    //Reset the UCSWRST bit to enable the USCI Module
    HWREG(baseAddress + OFS_UCAxCTLW0) &= ~(UCSWRST);
}

//*****************************************************************************
//
//! Disables the UART block.
//!
//! \param baseAddress is the base address of the USCI UART module.
//!
//! This will disable operation of the UART block.
//!
//! Modified register is \b UCAxCTL1
//!
//! \return None.
//
//*****************************************************************************
void EUSCI_UART_disable (unsigned int baseAddress)
{
    //Set the UCSWRST bit to disable the USCI Module
    HWREG(baseAddress + OFS_UCAxCTLW0) |= UCSWRST;
}

//*****************************************************************************
//
//! Gets the current UART status flags.
//!
//! \param baseAddress is the base address of the UART module.
//! \param mask is the masked interrupt flag status to be returned.
//!
//! This returns the status for the UART  module based on which
//! flag is passed. mask parameter can be either any of the following
//! selection.
//! - \b EUSCI_UART_LISTEN_ENABLE
//! - \b EUSCI_UART_FRAMING_ERROR
//! - \b EUSCI_UART_OVERRUN_ERROR
//! - \b EUSCI_UART_PARITY_ERROR
//! - \b eUARTBREAK_DETECT
//! - \b EUSCI_UART_RECEIVE_ERROR
//! - \b EUSCI_UART_ADDRESS_RECEIVED
//! - \b EUSCI_UART_IDLELINE
//! - \b EUSCI_UART_BUSY
//!
//! Modified register is \b UCAxSTAT
//!
//! \return the masked status flag
//
//*****************************************************************************
unsigned char EUSCI_UART_queryStatusFlags (unsigned int baseAddress,
    unsigned char mask)
{
    ASSERT((EUSCI_UART_LISTEN_ENABLE == mask) ||
        (EUSCI_UART_FRAMING_ERROR == mask) ||
        (EUSCI_UART_OVERRUN_ERROR == mask) ||
        (EUSCI_UART_PARITY_ERROR == mask) ||
        (eUARTBREAK_DETECT == mask) ||
        (EUSCI_UART_RECEIVE_ERROR == mask) ||
        (EUSCI_UART_ADDRESS_RECEIVED == mask) ||
        (EUSCI_UART_IDLELINE == mask) ||
        (EUSCI_UART_BUSY == mask)
        );
    return ( HWREG(baseAddress + OFS_UCAxSTATW) & mask );
}

//*****************************************************************************
//
//! Sets the UART module in dormant mode
//!
//! \param baseAddress is the base address of the UART module.
//!
//! Puts USCI in sleep mode
//! Only characters that are preceded by an idle-line or with address bit set
//! UCRXIFG. In UART mode with automatic baud-rate detection, only the
//! combination of a break and synch field sets UCRXIFG.
//!
//! Modified register is \b UCAxCTL1
//!
//! \return None.
//
//*****************************************************************************
void EUSCI_UART_setDormant (unsigned int baseAddress)
{
    HWREG(baseAddress + OFS_UCAxCTLW0) |= UCDORM;
}

//*****************************************************************************
//
//! Re-enables UART module from dormant mode
//!
//! \param baseAddress is the base address of the UART module.
//!
//! Not dormant. All received characters set UCRXIFG.
//!
//! Modified bits are \b UCDORM of \b UCAxCTL1 register.
//!
//! \return None.
//
//*****************************************************************************
void EUSCI_UART_resetDormant (unsigned int baseAddress)
{
    HWREG(baseAddress + OFS_UCAxCTLW0) &= ~UCDORM;
}

//*****************************************************************************
//
//! Transmits the next byte to be transmitted marked as address depending on
//! selected multiprocessor mode
//!
//! \param baseAddress is the base address of the UART module.
//! \param transmitAddress is the next byte to be transmitted
//!
//! Modified register is \b UCAxCTL1, \b UCAxTXBUF
//!
//! \return None.
//
//*****************************************************************************
void EUSCI_UART_transmitAddress (unsigned int baseAddress,
    unsigned char transmitAddress)
{
    //Set UCTXADDR bit
    HWREG(baseAddress + OFS_UCAxCTLW0) |= UCTXADDR;

    //Place next byte to be sent into the transmit buffer
    HWREG(baseAddress + OFS_UCAxTXBUF) = transmitAddress;
}

//*****************************************************************************
//
//! Transmit break. Transmits a break with the next write to the transmit
//! buffer. In UART mode with automatic baud-rate detection,
//! EUSCI_UART_AUTOMATICBAUDRATE_SYNC(0x55) must be written into UCAxTXBUF to
//! generate the required break/synch fields.
//! Otherwise, DEFAULT_SYNC(0x00) must be written into the transmit buffer.
//! Also ensures module is ready for transmitting the next data
//!
//! \param baseAddress is the base address of the UART module.
//!
//! Modified register is \b UCAxCTL1, \b UCAxTXBUF
//!
//! \return None.
//
//*****************************************************************************
void EUSCI_UART_transmitBreak (unsigned int baseAddress)
{
    //Set UCTXADDR bit
    HWREG(baseAddress + OFS_UCAxCTLW0) |= UCTXBRK;

    //If current mode is automatic baud-rate detection
    if (EUSCI_UART_AUTOMATIC_BAUDRATE_DETECTION_MODE ==
        (HWREG(baseAddress + OFS_UCAxCTLW0) &
         EUSCI_UART_AUTOMATIC_BAUDRATE_DETECTION_MODE)){
        HWREG(baseAddress + OFS_UCAxTXBUF) = EUSCI_UART_AUTOMATICBAUDRATE_SYNC;
    } else   {
        HWREG(baseAddress + OFS_UCAxTXBUF) = DEFAULT_SYNC;
    }

    //USCI TX buffer ready?
    while (!EUSCI_UART_getInterruptStatus(baseAddress, UCTXIFG)) ;
}

//*****************************************************************************
//
//! Returns the address of the RX Buffer of the UART for the DMA module.
//!
//! \param baseAddress is the base address of the UART module.
//!
//! Returns the address of the UART RX Buffer. This can be used in conjunction
//! with the DMA to store the received data directly to memory.
//!
//! \return None
//
//*****************************************************************************
unsigned long EUSCI_UART_getReceiveBufferAddressForDMA (unsigned int baseAddress)
{
    return ( baseAddress + OFS_UCAxRXBUF );
}

//*****************************************************************************
//
//! Returns the address of the TX Buffer of the UART for the DMA module.
//!
//! \param baseAddress is the base address of the UART module.
//!
//! Returns the address of the UART TX Buffer. This can be used in conjunction
//! with the DMA to obtain transmitted data directly from memory.
//!
//! \return None
//
//*****************************************************************************
unsigned long EUSCI_UART_getTransmitBufferAddressForDMA (unsigned int baseAddress)
{
    return ( baseAddress + OFS_UCAxTXBUF );
}

//*****************************************************************************
//
//! Sets the deglitch time
//!
//! \param baseAddress is the base address of the UART module.
//! \param deglitchTime is the selected deglitch time
//! 	Valid values are 
//! 		- \b EUSCI_UART_DEGLITCH_TIME_2ns
//! 		- \b EUSCI_UART_DEGLITCH_TIME_50ns
//! 		- \b EUSCI_UART_DEGLITCH_TIME_100ns
//! 		- \b EUSCI_UART_DEGLITCH_TIME_200ns
//!		
//!
//! Returns the address of the UART TX Buffer. This can be used in conjunction
//! with the DMA to obtain transmitted data directly from memory.
//!
//! \return None
//
//*****************************************************************************
void EUSCI_UART_selectDeglitchTime(unsigned int baseAddress,
			unsigned long deglitchTime
			)
{
	ASSERT((EUSCI_UART_DEGLITCH_TIME_2ns == deglitchTime) ||
        (EUSCI_UART_DEGLITCH_TIME_50ns == deglitchTime) ||
        (EUSCI_UART_DEGLITCH_TIME_100ns == deglitchTime) ||
        (EUSCI_UART_DEGLITCH_TIME_200ns == deglitchTime)
        );
    
    HWREG(baseAddress + OFS_UCAxCTLW1) &= ~(UCGLIT1 + UCGLIT0);
    
    HWREG(baseAddress + OFS_UCAxCTLW1) = deglitchTime;
}

/*****************************************************************//**
* @brief        		Initialize All UART Module.
* @param[in]        	UART Module like uartA0,uartA1 AND Baud Rate.
* @return           	None
**********************************************************************/
void Uart_Init(UartId_e uartx,long int BAUD_RATE)
{

	if(uartx==uartA0)
	{

