dwijaybane/msp430/Source Files/eusci_uart.c
	//P1.2,3 = USCI_A0 TXD/RXD
	GPIO_setAsPeripheralModuleFunctionOutputPin(
			GPIO_PORT_P1,
			GPIO_PIN2
			);

	GPIO_setAsPeripheralModuleFunctionInputPin(
			GPIO_PORT_P1,
			GPIO_PIN3
			);

	//Initialize USCI UART module
	if ( STATUS_FAIL == EUSCI_UART_init(EUSCI_A0_BASE,
				 EUSCI_UART_CLOCKSOURCE_SMCLK,
				 UCS_getSMCLK(UCS_BASE),
				 BAUD_RATE,
				 EUSCI_UART_NO_PARITY,
				 EUSCI_UART_LSB_FIRST,
				 EUSCI_UART_ONE_STOP_BIT,
				 EUSCI_UART_MODE,
				 EUSCI_UART_LOW_FREQUENCY_BAUDRATE_GENERATION ))
	{
		return;
	}
	//Enable UART module for operation
	EUSCI_UART_enable(EUSCI_A0_BASE);
	}
	else if(uartx==uartA1)
	{

		//P1.4,5 = USCI_A1 TXD/RXD
		GPIO_setAsPeripheralModuleFunctionOutputPin(
				GPIO_PORT_P1,
				GPIO_PIN4
				);

		GPIO_setAsPeripheralModuleFunctionInputPin(
				GPIO_PORT_P1,
				GPIO_PIN5
				);

		//Initialize USCI UART module
		if ( STATUS_FAIL == EUSCI_UART_init(EUSCI_A1_BASE,
							 EUSCI_UART_CLOCKSOURCE_SMCLK,
							 UCS_getSMCLK(UCS_BASE),
							 BAUD_RATE,
							 EUSCI_UART_NO_PARITY,
							 EUSCI_UART_LSB_FIRST,
							 EUSCI_UART_ONE_STOP_BIT,
							 EUSCI_UART_MODE,
							 EUSCI_UART_LOW_FREQUENCY_BAUDRATE_GENERATION ))
		{
			return;
		}
		//Enable UART module for operation
		EUSCI_UART_enable(EUSCI_A1_BASE);
	}
	else
	{

		//P1.2,3 = USCI_A1 TXD/RXD
		GPIO_setAsPeripheralModuleFunctionOutputPin(
				GPIO_PORT_P2,
				GPIO_PIN2
				);

		GPIO_setAsPeripheralModuleFunctionInputPin(
				GPIO_PORT_P2,
				GPIO_PIN3
				);

		//Initialize USCI UART module
		if ( STATUS_FAIL == EUSCI_UART_init(EUSCI_A2_BASE,
							 EUSCI_UART_CLOCKSOURCE_SMCLK,
							 UCS_getSMCLK(UCS_BASE),
							 BAUD_RATE,
							 EUSCI_UART_NO_PARITY,
							 EUSCI_UART_LSB_FIRST,
							 EUSCI_UART_ONE_STOP_BIT,
							 EUSCI_UART_MODE,
							 EUSCI_UART_LOW_FREQUENCY_BAUDRATE_GENERATION ))
		{
			return;
		}
		//Enable UART module for operation
		EUSCI_UART_enable(EUSCI_A2_BASE);
	}
}

/*****************************************************************//**
* @brief        		Write The Data to UART Port Selected.
* @param[in]        	UART Module like uartA0,uartA1 AND Data.
* @return           	None
**********************************************************************/
void WriteDataUart(UartId_e uartx,char Data)
{
	if(uartx==uartA0)
	{
		while (!EUSCI_UART_getInterruptStatus(EUSCI_A0_BASE,
						        EUSCI_UART_TRANSMIT_INTERRUPT_FLAG)) ;
		EUSCI_UART_transmitData(EUSCI_A0_BASE,Data);
	}
	else if(uartx==uartA1)
	{
		while (!EUSCI_UART_getInterruptStatus(EUSCI_A1_BASE,
				                EUSCI_UART_TRANSMIT_INTERRUPT_FLAG)) ;
		EUSCI_UART_transmitData(EUSCI_A1_BASE,Data);
	}
	else
	{
		while (!EUSCI_UART_getInterruptStatus(EUSCI_A2_BASE,
						        EUSCI_UART_TRANSMIT_INTERRUPT_FLAG)) ;
		EUSCI_UART_transmitData(EUSCI_A2_BASE,Data);
	}
}

/*****************************************************************//**
* @brief        		Write The String of Data to UART Port Selected.
* @param[in]        	UART Module like uartA0,uartA1 AND String of Data.
* @return           	None
**********************************************************************/
void WriteDataStringUart(UartId_e uartx,char *String)
{
    int i = 0;
	while (String[i] != 0)
	{
		WriteDataUart(uartx,String[i]);
		i++;
	}
}
//*****************************************************************************
//
//Close the Doxygen group.
//! @}
//
//*****************************************************************************
